In [3]:
import numpy as np
import pandas as pd
l=[23,54,90,54,68]
s=pd.Series(l)
print(s)

0    23
1    54
2    90
3    54
4    68
dtype: int64

In [5]:
import numpy as np
import pandas as pd
l=[23,54,90,54.5,68]
s=pd.Series(l)
print(s)

0    23.0
1    54.0
2    90.0
3    54.5
4    68.0
dtype: float64

In [9]:
a=np.array([12,15,25,30,45])
s1=pd.Series(a)
print(s1)

0    12
1    15
2    25
3    30
4    45
dtype: int32

In [11]:
#How to access the series of element
print(s1[1])
print('*'*25)
print(s1[0:5])

15
*************************
0    12
1    15
2    25
3    30
4    45
dtype: int32

In [13]:
li=[45,60,55,85,50]
s2=pd.Series(li,index=['A','B','C','D','E'])
print(s2)

A    45
B    60
C    55
D    85
E    50
dtype: int64

In [15]:
print(s2['B'])
print(s2[['D','E']])

60
D    85
E    50
dtype: int64

In [19]:
#Creating series from dictionary
dic={'Name':'Yasodha','ID':1234,'Degree':'B.E','Role':'Director'}
s3=pd.Series(dic)
print(s3)

Name       Yasodha
ID            1234
Degree         B.E
Role      Director
dtype: object

In [23]:
from pandas import Series
l4=[45,30,55,85,90]
s4=Series(l4)
print(s4)

0    45
1    30
2    55
3    85
4    90
dtype: int64

In [25]:
#To check the condition in series dat
s4>=45

0     True
1    False
2     True
3     True
4     True
dtype: bool

In [27]:
s4[s4>=45]

0    45
2    55
3    85
4    90
dtype: int64

In [31]:
#Dataframes-It is used for more than one dimensional array table generation
li=[[1,2,3,4],[5,6,7,8]]
df=pd.DataFrame(data=li)
print(df)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [33]:
df

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [37]:
df1=pd.DataFrame(np.arange(8).reshape(4,2),index=['r1','r2','r3','r4'],columns=['c1','c2'])
df1

    c1  c2
r1   0   1
r2   2   3
r3   4   5
r4   6   7

In [39]:
#Random value into Dateframe
df2=pd.DataFrame(np.random.randn(3,3),columns=['x','y','z'])
df2

          x         y         z
0 -0.128277 -0.901273  0.614167
1  0.411425 -1.236006  0.755337
2 -0.168254  2.133367  0.471055

In [43]:
di={'Calories':[420,380,350],'Duration':[50,45,78]}
df4=pd.DataFrame(di,['Day1','Day2','Day3'])
df4

      Calories  Duration
Day1       420        50
Day2       380        45
Day3       350        78

In [45]:
dic={'Name':['Monika','Yasodha','Jothi','Prakash'],'Degree':['M.E','B.E','B.Tech','MBA']}
df5=pd.DataFrame(dic)
df5

      Name  Degree
0   Monika     M.E
1  Yasodha     B.E
2    Jothi  B.Tech
3  Prakash     MBA

In [47]:
from pandas import Series,DataFrame
s1=Series([np.nan,1,2,3,np.nan],['r1','r2','r3','r4','r5'])
s1

r1    NaN
r2    1.0
r3    2.0
r4    3.0
r5    NaN
dtype: float64

In [49]:
#Returns True when there is a missing value
s1.isnull()

r1     True
r2    False
r3    False
r4    False
r5     True
dtype: bool

In [51]:
#Dropna-Drops the rows with missing values
s1.dropna()

r2    1.0
r3    2.0
r4    3.0
dtype: float64

In [61]:
n=np.nan
df5=DataFrame([[1,n,4],[4,5,n],[n,n,n]])
df5

     0    1    2
0  1.0  NaN  4.0
1  4.0  5.0  NaN
2  NaN  NaN  NaN

In [61]:
df5.isnull()

       0      1      2
0  False   True  False
1  False  False   True
2   True   True   True

In [65]:
df5.dropna()

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [7]:
#Dataframes-are used to more than one dimensional array
import numpy as np
import numpy as pd
from pandas import Series,DataFrame
#Nested list
l=[[1,2,3,4],[4,5,6,7]]
df=DataFrame(data=1,index=['r1','r2'],columns=['col1','col2','col3','col4'])
print(df)

    col1  col2  col3  col4
r1     1     1     1     1
r2     1     1     1     1

In [9]:
#Random volue in to DataFrame
df2=DataFrame(np.random.randn(3,3),columns=['x','y','z'])
df2

          x         y         z
0 -0.693553  1.433951 -0.639105
1  0.718183 -0.715981 -0.553569
2 -0.932439  0.139758 -0.124163

In [11]:
#randint(Low,high,array size)
df2=DataFrame(np.random.randint(2,20,(3,3)),columns=['x','y','z'])
df2

    x   y   z
0  10   3  15
1  19  12   6
2  13   3  15

In [13]:
df2=DataFrame(np.random.rand(3,3),columns=['x','y','z'])
df2

          x         y         z
0  0.999366  0.981991  0.902978
1  0.505211  0.466086  0.561406
2  0.464111  0.362384  0.722685

In [39]:
from pandas import Series,DataFrame
s1=Series([np.nan,1,2,3,np.nan],['r1','r2','r3','r4','r5'])
s1

r1    NaN
r2    1.0
r3    2.0
r4    3.0
r5    NaN
dtype: float64

In [49]:
s1.isnull()

r1     True
r2    False
r3    False
r4    False
r5     True
dtype: bool

In [65]:
df5.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [ ]:
#If the dataset has many missing values scattered throughout rows and coloumns,using drop method will cause a large amount
#of important data loss in such a cases, we are going to use fillna() method

In [67]:
df5

     0    1    2
0  1.0  NaN  4.0
1  4.0  5.0  NaN
2  NaN  NaN  NaN

In [73]:
df5.fillna(value=10)

      0     1     2
0   1.0  10.0   4.0
1   4.0   5.0  10.0
2  10.0  10.0  10.0

In [77]:
df5.fillna(value=df5.mean())

     0    1    2
0  1.0  5.0  4.0
1  4.0  5.0  4.0
2  2.5  5.0  4.0

In [79]:
#Replace - Series
s1=Series(np.arange(8))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: int32

In [81]:
s1.replace(0,'$')

0    $
1    1
2    2
3    3
4    4
5    5
6    6
7    7
dtype: object

In [83]:
df=DataFrame(np.arange(8))
df

   0
0  0
1  1
2  2
3  3
4  4
5  5
6  6
7  7

In [87]:
df.replace(0,'$')

   0
0  $
1  1
2  2
3  3
4  4
5  5
6  6
7  7

In [89]:
#inplace
s1.replace(0,'$',inplace=True)

In [91]:
s1.replace({2:55})

0     $
1     1
2    55
3     3
4     4
5     5
6     6
7     7
dtype: object

In [93]:
df1=DataFrame({'A':[1,2,3,4,5],
               'B':[6,7,8,9,10],
               'C':['Apple','kiwi','Grapes','Orange','Mango']})
df1

   A   B       C
0  1   6   Apple
1  2   7    kiwi
2  3   8  Grapes
3  4   9  Orange
4  5  10   Mango

In [95]:
df1.replace([1,2,3],10)

    A   B       C
0  10   6   Apple
1  10   7    kiwi
2  10   8  Grapes
3   4   9  Orange
4   5  10   Mango

In [107]:
df1.replace({'A':1,'B':8,'C':'kiwi'},100)

     A    B       C
0  100    6   Apple
1    2    7     100
2    3  100  Grapes
3    4    9  Orange
4    5   10   Mango

In [111]:
df1.replace({'c':{'Apple':'Pine Apple','kiwi':'Banana'}},inplace=True)
df1

   A   B       C
0  1   6   Apple
1  2   7    kiwi
2  3   8  Grapes
3  4   9  Orange
4  5  10   Mango